Autodesk.Revit.DB.Electrical.ElectricalSetting.GetCircuitNamingSchemeSettings(Autodesk.Revit.DB.Document)
Gets the circuit naming scheme settings of the project.
cda:
The document.
Returns:
The circuit naming scheme settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021

Autodesk.Revit.DB.Electrical.ElectricalSetting.GetElectricalSettings(Autodesk.Revit.DB.Document)
Get the electrical settings of the project.
document:
The document.
Returns:
The electrical settings of the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseC
Circuit Naming by Phase - Phase C Label.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015 Subscription Update

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseB
Circuit Naming by Phase - Phase B Label.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015 Subscription Update

Autodesk.Revit.DB.Electrical.ElectricalSetting.CircuitNamePhaseA
Circuit Naming by Phase - Phase A Label.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015 Subscription Update